//Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
int Numbers(string num)
{
    Console.Write(string message);
    string value = Console.ReadLine();
    int result = Convert.ToInt32(value);

}