// //Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.


// Console.WriteLine("Введите ваше число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// void PrintNumber(int k)
// {
//     if(k > 0)
//     {
//         Console.WriteLine(k);
//         k--;
//         PrintNumber(k);//Понятия не имею почему выводит введенную цифру дважды
        
//     }
// }

// PrintNumber(num);